{"vocabulary": ["'m", "'re", "'s", "10", "a", "ability", "about", "advice", "afraid", "afternoon", "age", "ai", "amazing", "an", "angry", "any", "anything", "appreciate", "appreciated", "are", "around", "artificial", "artist", "ask", "assist", "assistance", "at", "athlete", "automated", "awesome", "awful", "bad", "band", "based", "be", "beautiful", "been", "best", "better", "birth", "birthday", "bored", "born", "broken", "budget", "built", "bye", "call", "called", "can", "capability", "capable", "care", "catch", "championship", "chatbot", "chatbots", "check", "cold", "come", "computer", "connection", "cook", "cooking", "cool", "country", "created", "creator", "cuisine", "cup", "current", "date", "day", "designed", "destination", "developed", "developer", "device", "did", "different", "dinner", "disappointing", "dish", "do", "doing", "dumb", "eat", "emotion", "entertain", "evening", "ever", "everything", "excellent", "existing", "experience", "farewell", "favorite", "feature", "feel", "feeling", "film", "find", "fix", "food", "for", "forecast", "french", "from", "function", "functionality", "funny", "future", "game", "genre", "get", "go", "going", "good", "goodbye", "got", "great", "greeting", "happen", "happy", "hardware", "hate", "have", "healthy", "hello", "help", "helpful", "hey", "hi", "hiya", "hot", "hour", "how", "howdy", "human", "humanity", "humor", "i", "idea", "identity", "in", "information", "intelligence", "intelligent", "internet", "introduce", "is", "issue", "it", "job", "joke", "joy", "know", "language", "laptop", "later", "latest", "laugh", "learning", "leaving", "life", "like", "listen", "live", "located", "location", "lonely", "long", "lot", "love", "machine", "made", "make", "maker", "many", "may", "me", "meet", "month", "morning", "movie", "much", "multilingual", "music", "my", "n't", "name", "nearby", "need", "new", "news", "next", "nice", "not", "now", "of", "offer", "okay", "old", "olympics", "on", "option", "other", "outside", "owns", "pain", "people", "perform", "person", "phone", "physical", "place", "plan", "popular", "predict", "prediction", "problem", "programmed", "purpose", "rain", "real", "recipe", "recommend", "recommendation", "release", "report", "restaurant", "result", "right", "robot", "sad", "say", "see", "sentient", "service", "should", "slow", "smart", "snow", "so", "software", "something", "song", "soon", "spanish", "speak", "speed", "sport", "start", "stats", "stupid", "successful", "suck", "suggest", "suggestion", "sunny", "support", "supported", "take", "talk", "talking", "task", "team", "tech", "technology", "tell", "temperature", "terrible", "than", "thank", "thanks", "that", "the", "there", "thing", "this", "time", "tip", "to", "today", "tomorrow", "tourism", "travel", "trip", "troubleshooting", "umbrella", "understand", "until", "up", "use", "useless", "vacation", "visit", "wa", "watch", "we", "weather", "were", "what", "when", "where", "who", "wifi", "will", "won", "work", "working", "world", "worthless", "year", "you", "your", "yourself"], "tags": ["age", "ai", "capabilities", "compliment", "creator", "date", "feelings", "food", "future", "goodbye", "greeting", "help", "how_are_you", "insult", "joke", "language", "location", "movies", "music", "name", "sports", "tech_help", "thanks", "time", "travel", "unknown", "weather"], "input_shape": 317}